haclongtd1994/QuadCopter_STM32F4_STM32CUBEIDE/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
extern I2C_HandleTypeDef hi2c1;
extern TIM_HandleTypeDef htim3;
extern UART_HandleTypeDef huart4;

/* USER CODE END ET */


#include "Config_Types_Vars.h"

uint8_t data_receive[10];

bool isReadingAccelerometer;
struct AccelerometerReading accelerometerReading;

bool isReadingGyroscope;
struct GyroscopeReading gyroscopeReading;

bool sensorToggle;
struct AngularPosition angularPosition;

// Initialize 4 PWM input on board
struct PWMInput pwmInputTimer4;
struct PWMInput pwmInputTimer5;
struct PWMInput pwmInputTimer9;
struct PWMInput pwmInputTimer12;
// Store throttle
struct PWMInput* throttle;
struct PWMInput* remotePidProportional;
struct PWMInput* remotePidIntegral;
struct PWMInput* resetAngularPosition;

float thrust;
float rudder;
float aileron;
float elevator;

// Store PWM variable
float channel1Pulse;
float channel2Pulse;
float channel3Pulse;
float channel4Pulse;

/* -------------------- Timer 2 Variable ----------------- */
uint32_t secondsElapsed;
uint32_t intermediateMillis;


struct RingBuffer metricsRingBuffer;
uint32_t clearWarningsOnSecondsElapsed;

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
